{"class_name": "Functional", "config": {"name": "model_10", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_image"}, "name": "input_image", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_212", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_212", "inbound_nodes": [[["input_image", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_220", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_220", "inbound_nodes": [[["conv2d_212", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_221", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_221", "inbound_nodes": [[["batch_normalization_220", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool1", "inbound_nodes": [[["activation_221", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_213", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_213", "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_221", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_221", "inbound_nodes": [[["conv2d_213", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_222", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_222", "inbound_nodes": [[["batch_normalization_221", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "pool2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool2", "inbound_nodes": [[["activation_222", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_215", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_215", "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_223", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_223", "inbound_nodes": [[["conv2d_215", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_224", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_224", "inbound_nodes": [[["batch_normalization_223", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "pool3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool3", "inbound_nodes": [[["activation_224", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_218", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_218", "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_226", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_226", "inbound_nodes": [[["conv2d_218", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_227", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_227", "inbound_nodes": [[["batch_normalization_226", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "pool4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool4", "inbound_nodes": [[["activation_227", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_222", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_222", "inbound_nodes": [[["pool4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_230", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_230", "inbound_nodes": [[["conv2d_222", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_231", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_231", "inbound_nodes": [[["batch_normalization_230", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up42", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up42", "inbound_nodes": [[["activation_231", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge42", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge42", "inbound_nodes": [[["up42", 0, 0, {}], ["activation_227", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up32", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up32", "inbound_nodes": [[["activation_227", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_223", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_223", "inbound_nodes": [[["merge42", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge32", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge32", "inbound_nodes": [[["up32", 0, 0, {}], ["activation_224", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up22", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up22", "inbound_nodes": [[["activation_224", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_231", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_231", "inbound_nodes": [[["conv2d_223", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_219", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_219", "inbound_nodes": [[["merge32", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge22", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge22", "inbound_nodes": [[["up22", 0, 0, {}], ["activation_222", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up12", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up12", "inbound_nodes": [[["activation_222", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_232", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_232", "inbound_nodes": [[["batch_normalization_231", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_227", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_227", "inbound_nodes": [[["conv2d_219", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_216", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_216", "inbound_nodes": [[["merge22", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge12", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge12", "inbound_nodes": [[["up12", 0, 0, {}], ["activation_221", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up33", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up33", "inbound_nodes": [[["activation_232", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_228", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_228", "inbound_nodes": [[["batch_normalization_227", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_224", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_224", "inbound_nodes": [[["conv2d_216", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_214", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_214", "inbound_nodes": [[["merge12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge33", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge33", "inbound_nodes": [[["up33", 0, 0, {}], ["activation_224", 0, 0, {}], ["activation_228", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_225", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_225", "inbound_nodes": [[["batch_normalization_224", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up23", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up23", "inbound_nodes": [[["activation_228", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_222", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_222", "inbound_nodes": [[["conv2d_214", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_224", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_224", "inbound_nodes": [[["merge33", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge23", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge23", "inbound_nodes": [[["up23", 0, 0, {}], ["activation_222", 0, 0, {}], ["activation_225", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_223", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_223", "inbound_nodes": [[["batch_normalization_222", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up13", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up13", "inbound_nodes": [[["activation_225", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_232", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_232", "inbound_nodes": [[["conv2d_224", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_220", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_220", "inbound_nodes": [[["merge23", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge13", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge13", "inbound_nodes": [[["up13", 0, 0, {}], ["activation_221", 0, 0, {}], ["activation_223", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_233", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_233", "inbound_nodes": [[["batch_normalization_232", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_228", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_228", "inbound_nodes": [[["conv2d_220", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_217", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_217", "inbound_nodes": [[["merge13", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up24", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up24", "inbound_nodes": [[["activation_233", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_229", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_229", "inbound_nodes": [[["batch_normalization_228", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_225", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_225", "inbound_nodes": [[["conv2d_217", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge24", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge24", "inbound_nodes": [[["up24", 0, 0, {}], ["activation_222", 0, 0, {}], ["activation_225", 0, 0, {}], ["activation_229", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_226", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_226", "inbound_nodes": [[["batch_normalization_225", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up14", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up14", "inbound_nodes": [[["activation_229", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_225", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_225", "inbound_nodes": [[["merge24", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge14", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge14", "inbound_nodes": [[["up14", 0, 0, {}], ["activation_221", 0, 0, {}], ["activation_223", 0, 0, {}], ["activation_226", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_233", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_233", "inbound_nodes": [[["conv2d_225", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_221", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_221", "inbound_nodes": [[["merge14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_234", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_234", "inbound_nodes": [[["batch_normalization_233", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_229", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_229", "inbound_nodes": [[["conv2d_221", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "up15", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "up15", "inbound_nodes": [[["activation_234", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_230", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_230", "inbound_nodes": [[["batch_normalization_229", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "merge15", "trainable": true, "dtype": "float32", "axis": -1}, "name": "merge15", "inbound_nodes": [[["up15", 0, 0, {}], ["activation_221", 0, 0, {}], ["activation_223", 0, 0, {}], ["activation_226", 0, 0, {}], ["activation_230", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_226", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_226", "inbound_nodes": [[["merge15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_234", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_234", "inbound_nodes": [[["conv2d_226", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_235", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_235", "inbound_nodes": [[["batch_normalization_234", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "output_4", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_4", "inbound_nodes": [[["activation_235", 0, 0, {}]]]}], "input_layers": [["input_image", 0, 0]], "output_layers": [["output_4", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}